void main() {
  int a = 5, b = 3;

  // ตัวดำเนินการเปรียบเทียบ
  print('$a == $b = ${a == b}'); // เท่ากับ
  print('$a != $b = ${a != b}'); // ไม่เท่ากับ
  print('$a > $b = ${a > b}'); // มากกว่า
  print('$a < $b = ${a < b}'); // น้อยกว่า
  print('$a >= 5 = ${a >= 5}'); // มากกว่าหรือเท่ากับ
  print('$b <= 2 = ${b <= 2}'); // น้อยกว่าหรือเท่ากับ

  // ตัวดำเนินการทางตรรกะ
  print('(5 > 3) && (2 > 1) = ${(5 > 3) && (2 > 1)}'); // AND
  print('(5 < 3) || (2 > 1) = ${(5 < 3) || (2 > 1)}'); // OR
  print('!(5 > 3) = ${!(5 > 3)}'); // NOT
}